docs/0855.md.json

["```\r\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n                  xmlns:gs=\"http://www.baeldung.com/springsoap/gen\">\r\n    <soapenv:Header/>\r\n    <soapenv:Body>\r\n        <gs:getCountryRequest>\r\n            <gs:name>Spain</gs:name>\r\n        </gs:getCountryRequest>\r\n    </soapenv:Body>\r\n</soapenv:Envelope>\r\n```","```\r\n<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n<SOAP-ENV:Header/>\r\n<SOAP-ENV:Body>\r\n    <ns2:getCountryResponse xmlns:ns2=\"http://www.baeldung.com/springsoap/gen\">\r\n        <ns2:country>\r\n            <ns2:name>Spain</ns2:name>\r\n            <ns2:population>46704314</ns2:population>\r\n            <ns2:capital>Madrid</ns2:capital>\r\n            <ns2:currency>EUR</ns2:currency>\r\n        </ns2:country>\r\n    </ns2:getCountryResponse>\r\n</SOAP-ENV:Body>\r\n</SOAP-ENV:Envelope>\r\n```"]